# vstSetModeHelpBase

## Description
```pascal
PROCEDURE vstSetModeHelpBase(inTextRsrcIDBase : INTEGER);
```

```python

def vs.vstSetModeHelpBase(inTextRsrcIDBase):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inTextRsrcIDBase|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events